Revit 2027 API
ExternalGeometryId.GetHashCode Method
 Gets the hash code.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
public:
virtual int GetHashCode() override
abstract GetHashCode : unit -> int
override GetHashCode : unit -> int
Return Value
Int32
See Also
Reference
ExternalGeometryId Class
Autodesk.Revit.DB Namespace